[
  {
    "heading": "CLASH",
    "body": "Put your logical acumen and coding expertise to the test as you clash with a round of perplexing MCQs followed by a set of time-bound coding challenges,carefully designed to assess your command over programming in the language of your choice- Python, C or C++. Showcase your technical proficiency as you have a go at competitive coding with plenty to learn and nothing to lose.",
    "id": 101,
    "structure": {
      "1": "Round-1: A 28 minute round of MCQs for individuals as well as a team(max 2 people) contenders  based on coding concepts in C/C++, Java and python, divided into Juniors and Seniors category. Juniors including F.E’s and S.E's, seniors including T.E’s and B.E’s  where you would also be provided with 3 boonful lifelines(description will be provided in the game itself) and the marking scheme would be as follows:- The primary marks allotted are +4 if answered correctly and -2 if the answer for a particular question is incorrect. If a question attempted is incorrect, then from the next question +2 marks are allotted for each correctly answered question, else -1 until you get a correct answer for upcoming questions.",
      "2": "Round-2: A 2 hour long round where each team or individuals have to solve 6-8 core competitive coding questions. Questions would be a blend of Data-Structures and Algorithms and mind bending Competitive programming Questions which the contenders would have to solve and pave their path to victory. Note: Junior level questions would be comparatively a little less challenging than the Senior level. Languges allowed to code are C/C++, Java and Python. Judging for round 2 will be based on the time and space efficiency of your code to solve the given challenges in restricted time."
    },
    "rules": {
      "1": "Contenders are not allowed to use multiple smart devices while solving the test and it would be considered as malpractice if Caught ",
      "2": "Teams or players are not allowed to use any IDE or software once the game has started.",
      "3": "You are not allowed to switch tabs or close the browser during the game. If you do so, you will be logged out automatically.",
      "4": "Multiple Device Logins from same account are strictly prohibited"
    },
    "amount": 50,
    "count": 1,
    "team": "Maximum 2 players are allowed",
    "max": 2,
    "contact": [
      {
        "name": "Devraj Shetake",
        "phone": "8208566305"
      },
      {
        "name": "Yash Mali",
        "phone": "9319809833"
      }
    ],
    "prizes": [
      {
        "1": "Sr. First Prize: Rs. 5000",
        "2": "Sr. Second Prize: Rs. 4000"
      },
      {
        "1": "Jr. First Prize: Rs. 5000",
        "2": "Jr. Second Prize: Rs. 4000"
      }
    ],
    "datetime": [
      "Round 1 (Slot 1): 12th May 2023, 10:00 AM to 6:00 PM",
      "Round 1 (Slot 2): 13th May 2023, 10:00 AM to 6:00 PM",
      "Round 2: 14th May 2023, 9:15 AM to 11:15 PM"
    ]
  },
  {
    "heading": "REVERSE CODING",
    "body": "A coding competition to test your conceptual understanding of algorithms and programming languages. Combine logic and agility to decipher given patterns and code to decode these sequences to find the final answer.",
    "rules": {
      "1": "Integer type questions which involve complex mathematical problems which are not easy to solve without coding.",
      "2": "A 30-minute game for a person or a team of two people.",
      "3": "Teams or players are allowed to use any IDE or software after the game has started.",
      "4": "You will have 3 lifelines (description will be provided in the game itself).",
      "5": "You are not allowed to switch tabs or close the browser during the game. If you do so, you will be logged out automatically.",
      "6": "You will have two attempts to answer a particular question. In the first attempt, the marking scheme will be +4 0. In the second attempt, the marking scheme will be changed to +2 -2."
    },
    "structure": {
      "1": "Round-1(Logic Round): A 30 minute round of Numerical Answer of Questions for individuals as well as a team(max 2 people) contenders  based on coding concepts in C/C++, Java and python divided into Juniors and Seniors category. Juniors including F.E’s and S.E's, seniors including T.E’s and B.E’s (Python, C/C++ for both the categories) where you would also be provided with 3 boonful lifelines(description will be provided in the game itself) and the marking scheme would be as follows:- The primary marks allotted are +4 if answered correctly and if the answer for a particular question is incorrect then the contenders gets second attempt +2 marks are allotted for the correctly answered question, else -2 and for the upcoming question again same marking scheme is repeated.",
      "2": "Round-2(Decipher and code Round): A 2 hour long round where each team or individuals have to solve 6 core code based questions with increasing difficulty and without the help of any Lifelines. Questions would be a blend of Data-Structures and Algorithms and mind bending Competitive programming Questions which the contenders would have to solve and pave their path to victory. Note: Junior level questions would be comparatively a little less challenging than the Senior level. Judging for round 2 will be based on the time and space efficiency of your code to solve the given challenges in restricted time."
    },
    "id": 102,
    "amount": 50,
    "count": 1,
    "team": "Maximum 2 players are allowed",
    "max": 2,
    "contact": [
      {
        "name": "Sarvesh Varade",
        "phone": "8788013967"
      },
      {
        "name": "Vansh Teppalwar",
        "phone": "7972851721"
      }
    ],
    "prizes": [
      {
        "1": "Sr. First Prize: Rs. 5000",
        "2": "Sr. Second Prize: Rs. 4000"
      },
      {
        "1": "Jr. First Prize: Rs. 5000",
        "2": "Jr. Second Prize: Rs. 4000"
      }
    ],
    "datetime": [
      "Round 1 (Slot 1): 12th May 2023, 10:00 AM to 6:00 PM",
      "Round 1 (Slot 2): 13th May 2023, 10:00 AM to 6:00 PM",
      "Round 2: 14th May 2023, 11:30 AM to 1:30 PM"
    ]
  },
  {
    "heading": "NETWORK TREASURE HUNT",
    "body": "Network Treasure Hunt is an online Treasure Hunt played across the globe. Read between the lines, find the hidden clues and connect the dots. You can use every tool at your disposal. Even with Google and Wikipedia by your side, it's going to be fun and challenging.",
    "structure": "Channel your inner Wednesday Addams to solve this great mystery of PISB's very own Nevermore Academy",
    "rules": {
      "1": "The questions in this contest have clues and hints in form of images, video, GIFs, audio, and text.",
      "2": "A user can submit their answer after 'question/' in the url by replacing put_your_answer_here, the answer shouldn't contain any spaces.",
      "3": "A correct answer will direct the user to the next question while an incorrect answer will redirect the user to the same question as before.",
      "4": "Top scorers will be visible on a dynamic leaderboard.",
      "5": "Additionally, a user will be awarded keys after solving a question and free keys will be awarded to active users after a certain duration of time.",
      "6": "Keys can be used to claim extra hints for questions further in the hunt.",
      "7": "The cost of the extra hint will be the ceiling function of 1.5 times the level of the current question.",
      "8": "A user can claim only 1 extra hint per question, so use this facility wisely.",
      "9": "After the 24-hour hunt, the one on the top of the leaderboard wins!",
      "10": "The winner will be declared once and there will be no change in our decision. Furthermore, users should play with one account only."
    },
    "id": 103,
    "amount": 0,
    "count": 1,
    "team": "Individual event",
    "max": 1,
    "contact": [
      {
        "name": "Harsh Bhat",
        "phone": "8983594252"
      },
      {
        "name": "Bhakti Mahurkar",
        "phone": "9307931414"
      }
    ],
    "prizes": [
      {
        "1": "First Prize: Rs. 3000",
        "2": "Second Prize: Rs. 2000"
      }
    ],
    "datetime": ["Start Time: 5th May 21:00 IST", "End Time: 6th May 21:00 IST"]
  },
  {
    "heading": "WALL STREET",
    "body": "'The stock market is a device for transferring money from the impatient to the patient.' - Warren Buffett Interested in learning about the stock market and improving your investment skills? Well you are in luck, as we bring you, 'Wall Street'",
    "structure": "Wall Street is a virtual Stock Market where you'll get the chance to simulate investing in the stock market and see how your choices stack up against others. With no real money on the line, you can experiment with different strategies and learn from your successes and failures.",
    "rules": {
      "1": "Each participant will be provided with a unique ID and password to log on the Wallstreet website and start playing.He/She is expected to buy stocks and subscribe to IPOs using the cash amount.",
      "2": "IPOs will be floated every day before start of the actual trading days to which participants can subscribe. ",
      "3": "A correct answer will direct the user to the next question while an incorrect answer will redirect the user to the same question as before.",
      "4": "IPO allocation will be visible on the first day of actual trading and will be done on a first come first serve basis. So keep an eye on our social media handles for constant updates.",
      "5": "As soon as the market opens at 9:00 AM on the first day, participant can see all the stocks along with their listing price.",
      "6": "The market will be up from 9:00 AM to 5:00 PM for 3 days.This period is defined as 'day' henceforth in the document.",
      "7": "Any buy bid or sell ask can be made within a margin of ±10% of the current share price.For ex,if the current market price of a share is Rs.100/-,a buy or sell bid can be made from any range between Rs. 90- Rs.110/-",
      "8": "A transaction fee of 1% of total transaction cost will be charged from both the seller and the buyer for every successful transaction between the two.",
      "9": "When a user places a buy bid for the shares of the company A, the amount he's bidding for will be immediately deducted from his account along with the relevant transaction fee of 1%. For ex. if the buyer buys 50 shares for Rs. 106 each share, the cost will be Rs.5300/-. Adding 1% transaction fee the final cost that'll be deducted from the buyer's account will be1.01*5300 = Rs.5353/-. This amount will be immediately deducted, and the user won't be able to access this amount.",
      "10": "The Ranking of the user is decided using a 'Valuation Formula'.Valuation of the user will be 60% of his total asset value in Shares acquired (according to current market prices) + 40% of the cash balance in his account.This total will be termed as the valuation amount.",
      "11": "Only Integral Bids allowed.Decimal values will be invalid.",
      "12": "Participants can be disqualified for MALPRACTICES.",
      "13": "News regarding the listed companies would be displayed every half an hour."
    },
    "id": 104,
    "amount": 50,
    "count": 1,
    "team": "Individual event",
    "max": 1,
    "contact": [
      {
        "name": "Shreyas Chandolkar",
        "phone": "9145527174"
      },
      {
        "name": "Harsh Bhat",
        "phone": "8983594252"
      }
    ],
    "prizes": [
      {
        "1": "First Prize: Rs. 4000",
        "2": "Second Prize: Rs. 3000"
      }
    ],
    "datetime": [
      "IPO release: From 9th May 2023",
      "Trading: 12th-14th May 2023, 9:15 AM to 3:30 PM"
    ]
  },
  {
    "heading": "B-PLAN",
    "body": "Looking for a thrilling and engaging event that showcases innovation and entrepreneurship? Look no further than B-Plan! Register now for an event as you get to be a deadly Shark Tank!",
    "structure": "You'll have a front-row seat to the action and become an actual shark to evaluate business and pitch them!",
    "rules": {
      "1": "This will be an auction round.Each participant will be provided with a limited wallet.Several companies will then be auctioned to the participants and they will have to buy them with their respective wallets.After the auction is over, the portfolio of each participant will then be judged based on the ratings given to each company and the top ones will then be qualified for round 2.",
      "2": "Participants will be divided into pitchers and sharks using lots. Each will then be judged based on their skill in the respective role. The pitchers will be provided with a pitch and they have to present it in front of the sharks to bag a deal. The sharks will be investors and decide which pitch they want to invest in."
    },
    "id": 105,
    "amount": 100,
    "count": 1,
    "team": "Individual event",
    "max": 1,
    "contact": [
      {
        "name": "Purvi Toshniwal",
        "phone": "7758874315"
      }
    ],
    "prizes": [
      {
        "1": "First Prize: Rs. 3000",
        "2": "Second Prize: Rs. 2000"
      }
    ],
    "datetime": ["To be Announced Soon."]
  },
  {
    "heading": "ENIGMA",
    "body": "Are you diligent enough to face the mind-boggling questions which will push your logical reasoning to its limits? Then do not miss this amazing opportunity.",
    "structure": "Enigma is a logical reasoning based questionnaire, which will test your aptitude, thinking capability, response time and mental ability. Get ready to put your Grey Cells to work!",
    "rules": {
      "1": "Electronic gadgets (phones, calculators, smart watches) are prohibited.",
      "2": "The first round is a 30 min aptitude test.",
      "3": "The second round will consist of a two-hour descriptive logical reasoning interview.",
      "4": "Enigma Wildcard is conducted specially for PICT students whose winners are directly promoted to Round 2 of the event free of cost."
    },
    "amount": 50,
    "count": 1,
    "team": "Maximum 2 players are allowed in a team.",
    "max": 2,
    "id": 106,
    "contact": [
      {
        "name": "Manas Sewatkar",
        "phone": "9028093133"
      },
      {
        "name": "Nidhi Yadav",
        "phone": "8767887493"
      }
    ],
    "prizes": [
      {
        "1": "First Prize: Rs. 3000",
        "2": "Second Prize: Rs. 2000"
      }
    ],
    "datetime": [
      "Round 1 (Slot 1): 12th May 2023, 12:00 PM to 12:30 PM",
      "Round 1 (Slot 2): 12th May 2023, 05:00 PM to 05:30 PM",
      "Round 2: 13th May 2023, 05:00 PM to 07:00 PM"
    ]
  },
  {
    "heading": "DATAWIZ",
    "body": "Get ready to set off on a journey to the world of data science! DataWiz gives you an opportunity to test your machine learning and data analytics skills, work on real world datasets to analyse and make predictions using your models.",
    "structure": {
      "1": "Get ready to set off on a journey to the world of data science.",
      "2": "DataWiz gives you an opportunity to test your machine learning and data analytics skills, work on datasets to analyse and make predictions using your models.",
      "3": "Datawiz is a week-long machine learning competition hosted on Kaggle.",
      "4": "The participants can form teams of up to 2 members and submit their predicted data values.",
      "5": "The team with the highest accuracy on the leaderboard at the end of the week will be declared as winners."
    },
    "rules": {
      "1": "Each team of students may consist of a maximum of 3 participants.",
      "2": "One account per participant will be allowed.",
      "3": "Signing In on Kaggle through Multiple accounts is prohibited.",
      "4": "No private sharing outside teams.",
      "5": "Privately sharing code or data outside the teams is not permitted.",
      "6": "Results should be reproducible to be eligible for prizes."
    },
    "id": 107,
    "amount": 50,
    "count": 1,
    "team": "Maximum 2 players are allowed",
    "max": 2,
    "contact": [
      {
        "name": "Aditya Medhe",
        "phone": "9370546447"
      },
      {
        "name": "Manas Sewatkar",
        "phone": "9028093133"
      }
    ],
    "prizes": [
      {
        "1": "First Prize: Rs. 3000",
        "2": "Second Prize: Rs. 2000"
      }
    ],
    "datetime": ["10th May 2023, 12:00 AM to 13th May 2023, 12:00 PM"]
  },
  {
    "heading": "QUIZ",
    "body": "Brainstorm on the questions ranging from Greek mythology to world politics, from Shakespeare to business gurus. Set out on a voyage through mind-boggling questions captained by a witty quiz master. Flex your IQ in a set of three quizzes, designed to be a battle of wits. MELA Quiz",
    "structure": {
      "1": "General Quiz: It includes everything from robotics to politics. Test your GK!",
      "2": "MELA Quiz: Movies Entertainment Literature and Arts (MELA) is all set to test your knowledge of literature, arts and entertainment. If you are an entertainment lover, this is for you!",
      "3": "BizTech Quiz: If you are passionate about marketing, economics and Business, then BizTech is the ultimate questionnaire you need to answer."
    },
    "rules": {
      "1": "Candidate pursuing an undergraduate program at any institute is allowed to participate. Participants are encouraged to maintain a copy of their ID card",
      "2": "Participants can register online on the official Credenz website.",
      "3": "Each team will have a maximum of one participant.",
      "4": "Marking scheme and other rules will be announced on the day of the event itself."
    },
    "id": 108,
    "amount": 50,
    "count": 1,
    "team": "Maximum 2 players are allowed",
    "max": 2,
    "contact": [
      {
        "name": "Aryan Mahajan",
        "phone": "9518327965"
      },
      {
        "name": "Samir Hendre",
        "phone": "9819261702"
      }
    ],
    "prizes": [
      {
        "1": "First Prize: Rs. 1000 (For each Category)"
      }
    ],
    "datetime": ["To be Announced Soon."]
  },
  {
    "heading": "CRETRONIX",
    "body": "Battle it out on the breadboard! Challenge your brains to clear a test where you demonstrate your knowledge in the field of electronics, physics, logical ability and building a circuit by interpreting the hints provided.",
    "structure": {
      "1": "Round 1: It will consist of Multiple Choice Questions (MCQs) based on theoretical and practical concepts of electronics. There will be 30 questions for a time limit of 60 minutes.",
      "2": "Round 2  : Participants will be given a problem statement and they are supposed to implement the circuit with the help of hardware components."
    },
    "rules": {
      "1": "Each team can consist of a maximum of 3 members.",
      "2": "Participants can use the given datasheets.",
      "3": " Use of Mobile is not allowed .",
      "4": "Use of a calculator is allowed . ",
      "5": "Participants are supposed to make a document which describes the proper working of the circuit."
    },
    "id": 109,
    "amount": 50,
    "count": 1,
    "team": "Maximum 3 players are allowed",
    "max": 3,
    "contact": [
      {
        "name": "Bhanupratap Jaiswal",
        "phone": "9860842600"
      },
      {
        "name": "Suyash Udchan",
        "phone": "7722079027"
      }
    ],
    "prizes": [
      {
        "1": " First Prize: Rs. 3000",
        "2": " Second Prize: Rs. 2000"
      }
    ],
    "datetime": [
      "Round 1 (Slot 1): 12th May 2023, 11:00 AM to 12:00 PM",
      "Round 2: 14th May 2023, 10:00 AM to 01:00 PM"
    ]
  },
  {
    "heading": "WEB WEAVER",
    "body": "Ever wondered how GSOC and other Open-Source programs work? Register now for web-weaver to get a taste!",
    "structure": {
      "1": "Round 1: It is the idea submission round. Participants need to submit the idea for way of approach using PPT or PDF for the given problem statements.",
      "2": "Round 2: It is the actual implementation of the problem statement. In the given time duration participants can submit their implementation to the given repo for the problem statement.",
      "3": "To View the problem statements, visit https://github.com/Credenz-Web-Weaver",
      "4": "Submit your ideas here. https://forms.gle/khmDuuHNbb2ioJ8g9"
    },
    "rules": {
      "1": "Each team can consist of a maximum of 3 members.",
      "2": "For first round, participants need to submit their idea about the problem statement in PPT or PDF.",
      "3": "Use of ready-made templates is not allowed.",
      "4": "People opting for backend are supposed to build at least a minimalistic frontend to showcase their work."
    },
    "id": 110,
    "amount": 75,
    "count": 1,
    "team": "Maximum 3 players are allowed",
    "max": 3,
    "contact": [
      {
        "name": "Sangmeshwar Mahajan",
        "phone": "8010965429"
      },
      {
        "name": "Devraj Shetake",
        "phone": "8208566305"
      }
    ],
    "prizes": [
      {
        "1": "First Prize: Rs. 3000",
        "2": "Second Prize: Rs. 2000"
      }
    ],
    "datetime": [
      "Round 1 Start: 7th May 2023",
      "Round 1 Submission : 11th May 11:59 PM",
      "Round 2: 13th May 2023, 10:00 AM to 6:00 PM (Offline)"
    ]
  }
]
